---
kind: method
id: M:Autodesk.Revit.DB.ExtensibleStorage.SchemaBuilder.GUIDIsValid(System.Guid)
source: html/8b959aef-0601-e3e0-38ed-5cd98323fa50.htm
---
# Autodesk.Revit.DB.ExtensibleStorage.SchemaBuilder.GUIDIsValid Method

Checks whether the supplied GUID value is valid.

## Syntax (C#)
```csharp
public static bool GUIDIsValid(
	Guid guid
)
```

## Parameters
- **guid** (`System.Guid`) - The GUID to check

## Returns
True if the GUID is valid